Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPCFEN</name>
                     <description>Write Protection Configuration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCTRL</name>
                     <description>Write Protection Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0.</description>
                           <value>0x768070</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>Version Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the Hardware Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPR</name>
               <description>Receive Pointer Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXPTR</name>
                     <description>Receive Pointer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <description>Receive Counter Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXCTR</name>
                     <description>Receive Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNPR</name>
               <description>Receive Next Pointer Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNPTR</name>
                     <description>Receive Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNCR</name>
               <description>Receive Next Counter Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNCTR</name>
                     <description>Receive Next Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTCR</name>
               <description>Transfer Control Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTDIS</name>
                     <description>Receiver Transfer Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTDIS</name>
                     <description>Transmitter Transfer Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBEN</name>
                     <description>Receiver Circular Buffer Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBDIS</name>
                     <description>Receiver Circular Buffer Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBEN</name>
                     <description>Transmitter Circular Buffer Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBDIS</name>
                     <description>Transmitter Circular Buffer Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRCLR</name>
                     <description>Transfer Bus Error Clear</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTSR</name>
               <description>Transfer Status Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBEN</name>
                     <description>Receiver Circular Buffer Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBEN</name>
                     <description>Transmitter Circular Buffer Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Transfer Bus Error</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPPTREN</name>
                     <description>Write Protection Pointer Registers Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCTREN</name>
                     <description>Write Protection Counter Registers Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Register Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation. Always reads as 0.</description>
                           <value>0x504443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
