Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM1</name>
         <baseAddress>0x40004000</baseAddress>
         <interrupt>
            <name>FLEXCOM1</name>
            <value>10</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM2</name>
         <baseAddress>0x40008000</baseAddress>
         <interrupt>
            <name>FLEXCOM2</name>
            <value>11</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM3</name>
         <baseAddress>0x4000C000</baseAddress>
         <interrupt>
            <name>FLEXCOM3</name>
            <value>12</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM4</name>
         <baseAddress>0x40010000</baseAddress>
         <interrupt>
            <name>FLEXCOM4</name>
            <value>13</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM5</name>
         <baseAddress>0x40014000</baseAddress>
         <interrupt>
            <name>FLEXCOM5</name>
            <value>14</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM6</name>
         <baseAddress>0x40018000</baseAddress>
         <interrupt>
            <name>FLEXCOM6</name>
            <value>15</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM7</name>
         <baseAddress>0x4001C000</baseAddress>
         <interrupt>
            <name>FLEXCOM7</name>
            <value>16</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378R</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x40053060</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x98</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MR</name>
               <description>GPBR Mode Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBRWP0</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP1</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP2</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP3</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP4</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP5</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP6</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP7</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP8</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP9</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP10</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP11</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP12</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP13</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP14</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRWP15</name>
                     <description>GPBRx Write Protection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP0</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP1</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP2</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP3</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP4</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP5</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP6</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP7</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP8</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP9</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP10</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP11</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP12</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP13</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP14</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPBRRP15</name>
                     <description>GPBRx Read Protection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>24</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of SYS_GPBRx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
