Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="MEM2MEM0">
         <name>MEM2MEM1</name>
         <baseAddress>0x48004000</baseAddress>
         <interrupt>
            <name>MEM2MEM1</name>
            <value>78</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>PIO0</name>
         <version>11264O</version>
         <description>Parallel Input/Output Controller</description>
         <groupName>PIO</groupName>
         <prependToName>PIO_</prependToName>
         <baseAddress>0x40048000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x15E8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>3</dim>
               <dimIncrement>64</dimIncrement>
               <name>PIO_GROUP[%s]</name>
               <description/>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>MSKR</name>
                  <description>PIO Mask Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>MSK0</name>
                        <description>PIO Line 0 Mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK0Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK1</name>
                        <description>PIO Line 1 Mask</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK1Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK2</name>
                        <description>PIO Line 2 Mask</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK2Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK3</name>
                        <description>PIO Line 3 Mask</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK3Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK4</name>
                        <description>PIO Line 4 Mask</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK4Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK5</name>
                        <description>PIO Line 5 Mask</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK5Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK6</name>
                        <description>PIO Line 6 Mask</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK6Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK7</name>
                        <description>PIO Line 7 Mask</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK7Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK8</name>
                        <description>PIO Line 8 Mask</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK8Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK9</name>
                        <description>PIO Line 9 Mask</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK9Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK10</name>
                        <description>PIO Line 10 Mask</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK10Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK11</name>
                        <description>PIO Line 11 Mask</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK11Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK12</name>
                        <description>PIO Line 12 Mask</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK12Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK13</name>
                        <description>PIO Line 13 Mask</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK13Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK14</name>
                        <description>PIO Line 14 Mask</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK14Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK15</name>
                        <description>PIO Line 15 Mask</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK15Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK16</name>
                        <description>PIO Line 16 Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK16Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK17</name>
                        <description>PIO Line 17 Mask</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK17Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK18</name>
                        <description>PIO Line 18 Mask</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK18Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK19</name>
                        <description>PIO Line 19 Mask</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK19Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSK20</name>
                        <description>PIO Line 20 Mask</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MSK20Select</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
