Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
            <register>
               <name>CPU_CKR</name>
               <description>CPU Clock Register</description>
               <addressOffset>0x002C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSS</name>
                     <description>Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CSSSelect</name>
                        <enumeratedValue>
                           <name>MD_SLOW_CLK</name>
                           <description>MD_SLCK is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAINCK</name>
                           <description>MAINCK is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLACK1</name>
                           <description>PLLACK1 is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLBCK</name>
                           <description>PLLBCK is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRES</name>
                     <description>Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESSelect</name>
                        <enumeratedValue>
                           <name>CLK_1</name>
                           <description>Selected clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_2</name>
                           <description>Selected clock divided by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_4</name>
                           <description>Selected clock divided by 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_8</name>
                           <description>Selected clock divided by 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_16</name>
                           <description>Selected clock divided by 16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_32</name>
                           <description>Selected clock divided by 32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_64</name>
                           <description>Selected clock divided by 64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_3</name>
                           <description>Selected clock divided by 3</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPCSS</name>
                     <description>Coprocessor MCK1 Source Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CPCSSSelect</name>
                        <enumeratedValue>
                           <name>MD_SLOW_CLK</name>
                           <description>MD_SLCK is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAINCK</name>
                           <description>MAINCK is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK0</name>
                           <description>MCK0 is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLACK1</name>
                           <description>PLLACK1 is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLBCK</name>
                           <description>PLLBCK is selected</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLCCK</name>
                           <description>PLLCCK is selected</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPPRES</name>
                     <description>Coprocessor MCK1 Prescaler</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CPPRESSelect</name>
                        <enumeratedValue>
                           <name>CLK_1</name>
                           <description>Selected clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_2</name>
                           <description>Selected clock divided by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_3</name>
                           <description>Selected clock divided by 3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_4</name>
                           <description>Selected clock divided by 4</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_5</name>
                           <description>Selected clock divided by 5</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_6</name>
                           <description>Selected clock divided by 6</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_7</name>
                           <description>Selected clock divided by 7</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_8</name>
                           <description>Selected clock divided by 8</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_9</name>
                           <description>Selected clock divided by 9</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_10</name>
                           <description>Selected clock divided by 10</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_11</name>
                           <description>Selected clock divided by 11</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_12</name>
                           <description>Selected clock divided by 12</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_13</name>
                           <description>Selected clock divided by 13</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_14</name>
                           <description>Selected clock divided by 14</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_15</name>
                           <description>Selected clock divided by 15</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_16</name>
                           <description>Selected clock divided by 16</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RATIO_MCK0DIV</name>
                     <description>MCK0 Clock Frequency Division for MCK0DIV Clock</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RATIO_MCK1DIV</name>
                     <description>MCK1 Clock Frequency Division for MCK1DIV Clock</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RATIO_MCK0DIV2</name>
                     <description>MCK0 Clock Frequency Division for MCK0DIV2 Clock</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>3</dim>
               <dimIncrement>4</dimIncrement>
               <name>PCK[%s]</name>
               <description>Programmable Clock Register (chid = 0)</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSS</name>
                     <description>Programmable Clock Source Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>CSSSelect</name>
                        <enumeratedValue>
                           <name>MD_SLOW_CLK</name>
                           <description>MD_SLCK is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TD_SLOW_CLOCK</name>
                           <description>TD_SLCK is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAINCK</name>
                           <description>MAINCK is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK0</name>
                           <description>MCK0 is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLACK1</name>
                           <description>PLLACK1 is selected.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLBCK</name>
                           <description>PLLBCK is selected.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLCCK</name>
                           <description>PLLCCK is selected.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLCSRC</name>
                           <description>PLLCSRC is selected.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRES</name>
                     <description>Programmable Clock Prescaler</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x0064</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>Main Crystal Oscillator Status Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock 0 Ready Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPMCKRDY</name>
                     <description>Coprocessor Master Clock Ready Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY3</name>
                     <description>Programmable Clock Ready 3 Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Clock Source Oscillator Selection Status Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>Main RC Oscillator Status Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XT32KERR</name>
                     <description>32.768 kHz Crystal Oscillator Error Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKMON</name>
                     <description>Master Clock 0 Clock Monitor Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x0068</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>Main Crystal Oscillator Status Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock 0 Ready Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPMCKRDY</name>
                     <description>Coprocessor Master Clock Ready Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt DIsable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt DIsable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt DIsable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY3</name>
                     <description>Programmable Clock Ready 3 Interrupt DIsable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Clock Source Oscillator Selection Status Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>Main RC Status Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XT32KERR</name>
                     <description>32.768 kHz Crystal Oscillator Error Interrupt Disable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKMON</name>
                     <description>Master Clock 0 Clock Monitor Interrupt Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
