Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTT</name>
         <version>6081Q</version>
         <description>Real-time Timer</description>
         <groupName>RTT</groupName>
         <prependToName>RTT_</prependToName>
         <baseAddress>0x40053020</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTT</name>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RTPRES</name>
                     <description>Real-time Timer Prescaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ALMIEN</name>
                     <description>Alarm Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINCIEN</name>
                     <description>Real-time Timer Increment Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTRST</name>
                     <description>Real-time Timer Restart</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTDIS</name>
                     <description>Real-time Timer Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INC2AEN</name>
                     <description>RTTINC2 Alarm and Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC1HZ</name>
                     <description>Real-Time Clock 1Hz Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AR</name>
               <description>Alarm Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ALMV</name>
                     <description>Alarm Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VR</name>
               <description>Value Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRTV</name>
                     <description>Current Real-time Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ALMS</name>
                     <description>Real-time Alarm Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINC</name>
                     <description>Prescaler Roll-over Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINC2</name>
                     <description>Predefined Number of Prescaler Roll-overs Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MODR</name>
               <description>Modulo Selection Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SELINC2</name>
                     <description>Selection of the 32-bit Counter Modulo to generate RTTINC2 Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SELINC2Select</name>
                        <enumeratedValue>
                           <name>NO_RTTINC2</name>
                           <description>The RTTINC2 flag never rises</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD64</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 64 equals 0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD128</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 128 equals 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD256</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 256 equals 0</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD512</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 512 equals 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD1024</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 1024 equals 0. Example: If RTPRES=32 then RTTINC2 flag rises once per second if the slow clock is 32.768 kHz.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD2048</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 2048 equals 0</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOD4096</name>
                           <description>The RTTINC2 flag is set when CRTV modulo 4096 equals 0</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
