Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
            <register>
               <name>WUMR</name>
               <description>Wakeup Mode Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPDBCEN0</name>
                     <description>Tamper Enable for WKUPx Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCEN1</name>
                     <description>Tamper Enable for WKUPx Pin</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCEN2</name>
                     <description>Tamper Enable for WKUPx Pin</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCEN3</name>
                     <description>Tamper Enable for WKUPx Pin</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCEN4</name>
                     <description>Tamper Enable for WKUPx Pin</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWUPDBC</name>
                     <description>Force Wake-up Inputs Debouncer Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FWUPDBCSelect</name>
                        <enumeratedValue>
                           <name>IMMEDIATE</name>
                           <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_SK</name>
                           <description>WKUPx shall be in its active state for at least 3 MD_SLCK periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_SK</name>
                           <description>WKUPx shall be in its active state for at least 32 MD_SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_SK</name>
                           <description>WKUPx shall be in its active state for at least 512 MD_SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096_SK</name>
                           <description>WKUPx shall be in its active state for at least 4,096 MD_SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32768_SK</name>
                           <description>WKUPx shall be in its active state for at least 32,768 MD_SLCK periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPDBC</name>
                     <description>Wake-up Inputs Debouncer Period</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WKUPDBCSelect</name>
                        <enumeratedValue>
                           <name>IMMEDIATE</name>
                           <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_SK</name>
                           <description>WKUPx shall be in its active state for at least 3 MD_SLCK periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_SK</name>
                           <description>WKUPx shall be in its active state for at least 32 MD_SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_SK</name>
                           <description>WKUPx shall be in its active state for at least 512 MD_SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096_SK</name>
                           <description>WKUPx shall be in its active state for at least 4,096 MD_SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32768_SK</name>
                           <description>WKUPx shall be in its active state for at least 32,768 MD_SLCK periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC0</name>
                     <description>Low-power Debouncer Period of WKUPx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBC0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUPx in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUPx in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUPx in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUPx in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUPx in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUPx in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUPx in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC1</name>
                     <description>Low-power Debouncer Period of WKUPx</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBC1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUPx in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUPx in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUPx in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUPx in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUPx in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUPx in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUPx in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC2</name>
                     <description>Low-power Debouncer Period of WKUPx</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBC2Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUPx in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUPx in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUPx in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUPx in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUPx in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUPx in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUPx in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC3</name>
                     <description>Low-power Debouncer Period of WKUPx</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBC3Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUPx in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUPx in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUPx in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUPx in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUPx in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUPx in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUPx in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDBC4</name>
                     <description>Low-power Debouncer Period of WKUPx</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LPDBC4Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the low-power debouncers.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_RTCOUT</name>
                           <description>WKUPx in active state for at least 2 RTCOUTx clock periods</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_RTCOUT</name>
                           <description>WKUPx in active state for at least 3 RTCOUTx clock periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_RTCOUT</name>
                           <description>WKUPx in active state for at least 4 RTCOUTx clock periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_5_RTCOUT</name>
                           <description>WKUPx in active state for at least 5 RTCOUTx clock periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6_RTCOUT</name>
                           <description>WKUPx in active state for at least 6 RTCOUTx clock periods</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_7_RTCOUT</name>
                           <description>WKUPx in active state for at least 7 RTCOUTx clock periods</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_RTCOUT</name>
                           <description>WKUPx in active state for at least 8 RTCOUTx clock periods</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
