Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX2051MTSH128.svd
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TDOSCSEL</name>
                     <description>Timing Domain 32 kHz Oscillator Selection Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDOSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL</name>
                           <description>The timing domain slow clock source is the 32.768 kHz crystal oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VDD3V3SMWS</name>
                     <description>VDD3V3 Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CORSMRSTS</name>
                     <description>VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMRSTS</name>
                     <description>VDD3V3 Supply Monitor Reset Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMIS</name>
                     <description>VDD3V3 Supply Monitor Interrupt Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDD3V3SMS</name>
                     <description>VDD3V3 Supply Monitor Output Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDS</name>
                     <description>LCD Power Domain Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWUPS</name>
                     <description>Force Wake-up Pin Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCS0</name>
                     <description>Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCS1</name>
                     <description>Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCS2</name>
                     <description>Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCS3</name>
                     <description>Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPDBCS4</name>
                     <description>Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SXFMS</name>
                     <description>Slow Crystal Oscillator Frequency Monitor Status (cleared on read)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SXFMSSelect</name>
                        <enumeratedValue>
                           <name>GOOD</name>
                           <description>No frequency error detected.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ_ERROR</name>
                           <description>The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAIL</name>
                           <description>No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SXFME</name>
                     <description>Slow Crystal Oscillator Frequency Monitor Error (cleared on read)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPS</name>
                     <description>WKUP Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BADXTS</name>
                     <description>Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FWKUPS</name>
                     <description>FWUP Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTS</name>
                     <description>RTT Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCS</name>
                     <description>RTC Wake-up Status (cleared by reading SUPC_WUSR)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR</name>
               <description>Extended Mode Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FLRSGPBR</name>
                     <description>Flash Erase GPBR</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FULLGPBRC</name>
                     <description>Full GPBR Clean</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COREBGEN</name>
                     <description>VDDCORE Voltage Regulator Bandgap Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BMR</name>
               <description>Backup Mode Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RTTWKEN</name>
                     <description>Real-time Timer Wake-up Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTTWKENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The RTT alarm signal has no wake-up effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The RTT alarm signal forces the wake-up of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTCWKEN</name>
                     <description>Real-time Clock Wake-up Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTCWKENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The RTC alarm signal has no wake-up effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The RTC alarm signal forces the wake-up of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBATWKEN</name>
                     <description>VBAT Supply Monitor Wake-up Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VBATWKENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Wake-up on VBAT supply monitor under voltage detection is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Wake-up on VBAT supply monitor under voltage detection is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FWUPEN</name>
                     <description>Force Wake-up Pin Wake-up Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FWUPENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The fwup signal has no wake-up effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The fwup signal forces the wake-up of the core power supply.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORPORWKEN</name>
                     <description>VDDCORE POR Wake-up Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORPORWKENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Wake-up on VDDCORE Power-On Reset Event is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Wake-up on VDDCORE Power-On Reset Event is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VDD3V3SMWKEN</name>
                     <description>VDD3V3 Supply Monitor Wake-up Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VDD3V3SMWKENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Wake-up on VDD3V3 supply monitor under voltage detection is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Wake-up on VDD3V3 supply monitor under voltage detection is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBATREN</name>
                     <description>Battery Voltage Event Report Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VBATRENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disables the report of event on VBAT voltage.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enables the report of event on VBAT voltage.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MRTCOUT</name>
                     <description>RTCOUT0 Outputs Drive Mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MRTCOUTSelect</name>
                        <enumeratedValue>
                           <name>USERDEF</name>
                           <description>RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0.</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BADXTWKEN</name>
                     <description>Slow Crystal Oscillator Frequency Error Wake-up Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
